app/controllers/admins/orders_controller.rb

	def top #今日の注文件数を表示
		@orders = Order.all
---
SELECT "orders".* FROM "orders"

	def index #注文一覧画面を表示
		@orders = Order.all.order(created_at: :desc)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC

	def show
		@order = Order.find(params[:id])
		@ordered_products = OrderedProduct.where(order_id: params[:id]
	end

	def update #注文ステータスの更新
		@order = Order.find(params[:id])
		@order.update(order_params)
		redirect_back(fallback_location: root_path)
	end

private
 def order_params
   params.require(:order).permit(:status)
 end
end

---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = ?  [["order_id", 25]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]