app/controllers/admins/products_controller.rb

  def index
    @products = Product.all.page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "products"

  def create
    @product = Product.new(product_params)
    binding.pry
    @product.genre_id = params[:product][:genre][:genre_id]
    if @product.save
---
INSERT INTO "products" ("genre_id", "product_image_id", "price", "description", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
  	product = Product.find(params[:id])
  	if product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "product_image_id" = ?, "genre_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_image_id", "1"], ["genre_id", 3], ["updated_at", "2020-03-22 03:12:22.494063"], ["id", 1]]