app/views/deliveries/index.html.erb

  <th></th>
  <%  @user.deliveries.each do |f| %>
---
SELECT "deliveries".* FROM "deliveries" WHERE "deliveries"."user_id" = ?  [["user_id", 2]]