app/views/orders/index.html.erb

SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
---
      <td>
      <% order.ordered_products.each do |ord| %>