app/views/orders/new.html.erb

     <!--  <%= form_for @user do |f| %>
      <%= f.select :user_id, Derivery.all.map { |g| [g.delivery, g.id] } %>
---
SELECT "deliveries".* FROM "deliveries" WHERE "deliveries"."user_id" = ?  [["user_id", 2]]