app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
---
  def show
    @carts = current_user.carts
    @total_price = 0
    @carts.each do |f|

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."product_id" = ? LIMIT ?  [["user_id", 2], ["product_id", 1], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."product_id" = ? AND "carts"."user_id" = ? LIMIT ?  [["product_id", 2], ["user_id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "product_id", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["product_id", 1], ["stock", 4], ["created_at", "2020-03-19 03:42:29.557339"], ["updated_at", "2020-03-19 03:42:29.557339"]]
UPDATE "carts" SET "stock" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["stock", 7], ["updated_at", "2020-03-22 05:26:05.679459"], ["id", 10]]
INSERT INTO "carts" ("user_id", "product_id", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["product_id", 2], ["stock", 4], ["created_at", "2020-03-19 07:11:00.399708"], ["updated_at", "2020-03-19 07:11:00.399708"]]
---
  def create
    @cart = Cart.new(cart_params)
    @user = User.find(params[:user_id])
    @findcart = current_user.carts

    if @findcart.find_by(product_id: params[:cart][:product_id]).present?
      # もし、クリックされた商品のIDがカートモデルに存在していたら数量を増やすだけのコード
      @cart = Cart.find_by(product_id: params[:cart][:product_id],user_id: params[:user_id])
      # 商品IDが送られてきた値と同一、かつユーザーIDが送られてきたIDと同一のもの（唯一のカート）を特定
      @cart.stock += params[:cart][:stock].to_i
      # そのカートのストックに、送られてきた追加したい文を加算する（データを整数値に直しています）
      @cart.save
      # whereで探すと配列として結果が出てsaveできないので、find_byを使いました。
      redirect_to user_carts_path(@user)
    else
    @cart.save

SELECT  "carts".* FROM "carts" WHERE "carts"."product_id" = ? AND "carts"."user_id" = ? LIMIT ?  [["product_id", 1], ["user_id", 3], ["LIMIT", 1]]
UPDATE "carts" SET "stock" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["stock", 6], ["updated_at", "2020-03-19 07:06:17.637043"], ["id", 7]]
---
  def update
    @cart = Cart.find_by(product_id: params[:cart][:product_id],user_id: params[:user_id])
    @cart.stock = params[:cart][:stock]
    @cart.save

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 9]]
---
  def destroy
  	@cart = Cart.find(params[:user_id])
    @cart.destroy

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 10]]
---
  def destroy_all
    @carts = current_user.carts
    @carts.destroy_all