app/controllers/deliveries_controller.rb

  def create
    @delivery = Delivery.new(delivery_params)
    @delivery.user_id = current_user.id
    # 親モデルであるUserのidと紐づいているため、Deriveryを保存する前にそれを保存。
    if @delivery.save
      redirect_back(fallback_location: root_path)
    else
      @user = User.find(params[:user_id])
---
INSERT INTO "deliveries" ("user_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["name", "ぱんださん"], ["postal_code", "0000000"], ["address", "ぱんだのへや"], ["created_at", "2020-03-17 10:10:56.525105"], ["updated_at", "2020-03-17 10:10:56.525105"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @delivery = Delivery.find(params[:id])
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @delivery = Delivery.find(params[:id])
    @delivery.destroy
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "deliveries" WHERE "deliveries"."id" = ?  [["id", 1]]

  def update
    @delivery = Delivery.find(params[:id])
    if @delivery.update(delivery_params)
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "deliveries" SET "name" = ?, "updated_at" = ? WHERE "deliveries"."id" = ?  [["name", "あああ"], ["updated_at", "2020-03-15 08:32:31.998236"], ["id", 1]]