app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "products".* FROM "products" WHERE "products"."genre_id" = ? LIMIT ?  [["genre_id", 1], ["LIMIT", 1]]
---
  def show
    @genres = Genre.all
    @product = Product.where(genre_id: params[:id])