app/controllers/homes_controller.rb

  def top
    @genres = Genre.all
    @products = Product.first(4)
---
SELECT "genres".* FROM "genres"
SELECT "products".* FROM "products"