app/controllers/orders_controller.rb

  def confirm #注文確認画面を表示する
    @order = Order.new(order_params)
    @order.ordered_products.build

    @carts = current_user.carts

    if params[:address_button] == "my_address" #ご自身の住所
      @order.postal_code = current_user.postal_code
      @order.address = current_user.address
      @order.name = current_user.name
    elsif params[:address_button] == "deliveries_address" #保存してある住所
      @order.postal_code = Delivery.find(params[:select]).postal_code
      @order.address = Delivery.find(params[:select]).address
      @order.name = Delivery.find(params[:select]).name
    end
    # 合計個数機能
    @cart = current_user.carts
    @total_stock = @cart.sum(:stock)

    # 合計金額
    @total_price = 0 #初期化している
    @carts.each do |f|
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
SELECT SUM("carts"."stock") FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
SELECT SUM(price) FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]

  def create #注文情報を作成する
    @order = Order.new(order_params)
    if @order.save
---
INSERT INTO "orders" ("user_id", "name", "postal_code", "address", "payment", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def index #注文履歴一覧を表示する
    @orders = Order.all.order(created_at: :desc)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC

  def show #注文履歴詳細を表示する
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]