app/controllers/products_controller.rb

SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "products" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
  	@products = Product.page(params[:page])