app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = ?, "last_kana" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "吾郎座ぶろう"], ["last_kana", "ゴロウザブロウ"], ["updated_at", "2020-03-16 09:59:02.035772"], ["id", 3]]

  def confirm_destroy
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def hide
    @user = User.find(params[:id])
    #真偽値反転
    @user.toggle!(:status)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", 0], ["updated_at", "2020-03-16 03:48:39.433718"], ["id", 1]]