app/views/products/index.html.erb

  <div class="col-md-10">
    <h3 class="product-index">商品一覧（全<%= @products.count %>件）</h3>
---
SELECT COUNT(*) FROM "products"