app/views/admins/orders/index.html.erb

      <td>
      <% order.ordered_products.each do |ord| %>
        <%= Product.where(id: ord.product_id) %><br>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = ?  [["order_id", 33]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]